Revit 2027 API
SystemsAnalysisReportStyle Enumeration
 The report style of systems analysis.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum SystemsAnalysisReportStyle
Public Enumeration SystemsAnalysisReportStyle
public enum class SystemsAnalysisReportStyle
type SystemsAnalysisReportStyle
Members
Member name | Value | Description
Detailed | 0 |  The detailed report style.
Loads | 1 |  The loads report style.
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace